In [8]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [9]:
df.drop(['Name','PassengerId','Ticket','Cabin','Embarked','SibSp','Parch','Parch'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [24]:
target=df.Survived
inputs=df.drop(['Survived'],axis='columns')

In [29]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(5)
# u can aslo use "oneHotEncoding"

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [30]:
inputs=pd.concat([inputs,dummies],axis="columns")
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [31]:
inputs.drop(['Sex'],axis="columns",inplace=True)

In [32]:
inputs.head()
# now upto  here i remove all the text from my dataframe....now my real work shall start

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [33]:
inputs.columns[inputs.isna().any()]
# just to find if any "Nan" values are there or not......so if there any "NaN" values it will return that column

Index(['Age'], dtype='object')

In [34]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.Age.head()
# so all "NaN" values are replaced by mean of age in "Age" column

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [35]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [36]:
y_train

41     0
157    0
669    1
608    1
359    1
      ..
82     1
521    0
760    0
337    1
256    1
Name: Survived, Length: 623, dtype: int64

In [37]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [38]:
model.fit(X_train,y_train)

GaussianNB()

In [39]:
model.score(X_test,y_test)

0.8022388059701493

In [40]:
model.predict(X_test[:10])

array([1, 1, 0, 1, 0, 0, 0, 0, 0, 0], dtype=int64)

In [41]:
X_test[:10]

     Pclass        Age     Fare  female  male
426       2  28.000000  26.0000       1     0
369       1  24.000000  69.3000       1     0
848       2  28.000000  33.0000       0     1
593       3  29.699118   7.7500       1     0
636       3  32.000000   7.9250       0     1
522       3  29.699118   7.2250       0     1
159       3  29.699118  69.5500       0     1
705       2  39.000000  26.0000       0     1
703       3  25.000000   7.7417       0     1
202       3  34.000000   6.4958       0     1

In [42]:
model.predict_proba(X_test[:10])

array([[0.02633811, 0.97366189],
       [0.00241549, 0.99758451],
       [0.97044737, 0.02955263],
       [0.05480677, 0.94519323],
       [0.98747567, 0.01252433],
       [0.98703768, 0.01296232],
       [0.95928318, 0.04071682],
       [0.97609511, 0.02390489],
       [0.98617373, 0.01382627],
       [0.98767447, 0.01232553]])